'use client';
import { useState } from 'react';
import { Navbar, Footer } from '@/components/index';

export default function Page() {
  const [selectedRound, setSelectedRound] = useState<string>('');
  const rounds = [
    { label: 'รอบ 1 Portfolio', value: 'portfolio' },
    { label: 'รอบ 2 โควตา', value: 'quota' },
    { label: 'รอบ 3 Admission', value: 'admission' },
    { label: 'รอบ 4 รับตรงอิสระ', value: 'direct-admission' },
  ];

  const roundDetails: Record<string, string> = {
    portfolio: `
      รอบ Portfolio เป็นการรับนักเรียน โดยเน้นคัดเลือกจากคุณสมบัติของผู้สมัคร และพิจารณาจากแฟ้มสะสมผลงาน (Portfolio), 
      เกรดเฉลี่ย (GPAX) หรือคุณสมบัติอื่นๆ ที่มีความเกี่ยวข้องกับสาขานั้นๆ
      แต่ละคณะ/มหาวิทยาลัย จะกำหนดลักษณะหรือรูปแบบของแฟ้มสะสมผลงานที่แตกต่างกัน เช่น จำนวนผลงาน, ประเภทของผลงาน, 
      ระดับการแข่งขันของผลงาน ไปจนถึงการเขียนเรียงความ
      อย่างไรก็ตามใน TCAS67 อาจมีบางแห่งนำคะแนนสอบส่วนกลางมาใช้ด้วย

      ใช้เกรดกี่เทอม ?
      4 - 5 เทอม

      องค์ประกอบ/คะแนนที่ใช้คัดเลือก:
      Portfolio, GPAX, GPA, คะแนนทดสอบทางภาษา, ความสามารถพิเศษ, สอบสัมภาษณ์, คะแนนสอบอื่นๆ ที่คณะกำหนดใช้
    `,
    quota: `
      รอบโควตา เน้นการรับสมัครนักเรียนที่มีคุณสมบัติเฉพาะ เช่น กลุ่มนักเรียนในเขตพื้นที่ กลุ่มนักเรียนในโควตาโรงเรียน, 
      กลุ่มนักเรียนในภูมิภาค หรือกลุ่มนักเรียนที่มีความสามารถพิเศษ
      จะใช้คะแนนสอบส่วนกลางที่ ทปอ. เป็นผู้จัดสอบ เช่น TGAT/TPAT A-Level หรือ มหาวิทยาลัยจัดสอบวิชาเฉพาะของตนเอง 
      รวมถึงอาจมีการใช้ GPAX และ GPA 6 เทอม
      ยังถือเป็นรอบที่มีเกณฑ์คัดเลือกที่หลากหลาย เพราะมหาวิทยาลัยเป็นผู้กำหนดเกณฑ์คัดเลือกเองเพื่อให้ได้นักเรียนที่ตรงตามความต้องการมากที่สุด

      ใช้เกรดกี่เทอม ?
      6 เทอม

      องค์ประกอบ/คะแนนที่ใช้คัดเลือก:
      GPAX, GPA, TGAT/TPAT, A-Level, วิชาเฉพาะของมหาวิทยาลัย, ความสามารถพิเศษ, สอบสัมภาษณ์, คะแนนทดสอบภาษาอังกฤษ
    `,
    admission: `
      รอบ Admission เป็นรอบสำคัญ ที่มหาวิทยาลัยในระบบ TCAS ทั่วประเทศ รวมทั้ง กสพท จะเปิดรับสมัครพร้อมกันผ่านระบบกลาง ทปอ. ที่เว็บไซต์ myTCAS
      โดยกำหนดการรับจะอยู่ในช่วงเดือนพฤษภาคม ซึ่งจำนวนที่เปิดรับในรอบนี้อาจมีการเปลี่ยนแปลงได้ หากในรอบ 1 และ 2 มหาวิทยาลัยนั้นๆ ได้จำนวนนักเรียนไม่ครบ
      ก็มีโอกาสที่จะเปิดรับเพิ่มในรอบ 3 Admission

      ปัจจุบัน เกณฑ์รอบ Admission จะเป็นเกณฑ์ที่มหาวิทยาลัยกำหนดเอง โดยจะเลือกใช้คะแนนจากข้อสอบกลาง TGAT/TPAT และ A-Level ตามสัดส่วนค่าน้ำหนักที่มหาวิทยาลัยต้องการ
      ดังนั้นสาขาเดียวกัน แต่ต่างมหาวิทยาลัยก็อาจจะใช้เกณฑ์ไม่เหมือนกัน

      โดยในการรับสมัคร ผู้สมัครแต่ละรายสามารถเลือกได้สูงสุด 10 อันดับ (แบบเรียงอันดับ) โดยสามารถเลือก กสพท รวมกับคณะอื่นๆ ได้ด้วย 
      ค่าใช้จ่ายคิดตามจำนวนอันดับที่สมัคร สูงสุด 10 อันดับ 900 บาท แต่ล่าสุด มีนโยบายจากกระทรวงการอุดมศึกษา วิทยาศาสตร์ วิจัยและนวัตกรรม ให้สมัคร TCAS67 ฟรี 
      และยังคงเลือกได้สูงสุด 10 อันดับเช่นเดิม
      รอบ Admission จะมีการประมวลผล 2 ครั้งเพื่อเพิ่มโอกาสสอบติด โดยหลังจากประกาศผลครั้งที่ 1 แล้ว หากผู้สมัครไม่ผ่านการคัดเลือกหรือไม่พอใจกับอันดับที่ผ่านการคัดเลือก
      สามารถยื่นขอประมวลผลครั้งที่ 2 ได้ โดยใช้ข้อมูลการสมัครเดิม หากอันดับนั้นๆ มีผู้สละสิทธิ์ ก็มีโอกาสได้รับการประมวลผลครั้งที่ 2 และสอบติดในอันดับที่สูงขึ้นได้
      ซึ่งการประมวลผลครั้งที่ 2 นี้ จะไม่มีทางที่ได้ในอันดับที่แย่ลงกว่าเดิม

      การสละสิทธิ์ในรอบ 3 Admission จะต้องเป็นผู้ที่ยืนยันสิทธิ์รอบ 3 Admission และไม่เคยสละสิทธิ์มาก่อนเท่านั้น

      ใช้เกรดกี่เทอม ?
      6 เทอม

      องค์ประกอบ/คะแนนที่ใช้คัดเลือก:
      GPAX/GPA, TGAT/TPAT, A-Level, วิชาเฉพาะของมหาวิทยาลัย
    `,
    'direct-admission': `
      รอบ 4 Direct Admission หรือ รับตรงอิสระ เป็นรอบที่มหาวิทยาลัยเปิดรับเองหลังจากประกาศผลการคัดเลือกในรอบ 3 Admission แล้ว
      ซึ่งเกณฑ์คัดเลือก อาจเหมือนหรือแตกต่างจากรอบก่อนๆ ก็ได้ เน้นรับกลุ่มนักเรียนที่ยังไม่ผ่านการคัดเลือกรอบต่างๆ หรือ นักเรียนที่สละสิทธิ์เพื่อมารอรอบถัดไป

      ใช้เกรดกี่เทอม ?
      6 เทอม

      องค์ประกอบ/คะแนนที่ใช้คัดเลือก:
      GPAX, GPA, TGAT/TPAT, A-Level, วิชาเฉพาะของมหาวิทยาลัย, Portfolio, สอบสัมภาษณ์
    `,
  };

  return (
    <>
      <Navbar />
      <div className="pt-10 px-20 py-10">
        <div className="text-primary-600 text-headline-4 font-semibold mb-6">TCAS คือ</div>
        <div className="text-monochrome-950 text-body-large leading-relaxed ml-8">
          TCAS ย่อมาจาก Thai University Central Admission System คือ ระบบการคัดเลือกสอบเข้ามหาวิทยาลัย
          โดยเปรียบเสมือนพื้นที่กลางที่มหาวิทยาลัยเข้าระบบมาเพื่อรับสมัครนักเรียน และนักเรียนก็สามารถเข้ามาหามหาวิทยาลัยที่ต้องการได้
          <br />
          <br />
          แม้ว่า TCASสามารถสมัครได้ทุกวุฒิทั้ง ม.6 สายอาชีพ เทียบเท่า และเทียบวุฒิ GED อย่างไรก็ตามต้องดูรายละเอียดคณะอีกครั้งว่ารับทุกวุฒิหรือไม่
          ปัจจุบัน รูปแบบ TCAS67 แทบจะไม่แตกต่างจาก TCAS66 เลย ทั้งเรื่องระบบการจัดการ และข้อสอบ รวมถึงการคัดเลือกต่างๆ สำหรับ TCAS67 แบ่งการรับออกเป็น 4 รอบ ดังนี้
          <br />
          <br />
          <ul className="list-disc ml-8">
            <li>รอบที่ 1 รอบ Portfolio (ใช้แฟ้มสะสมผลงาน)</li>
            <li>รอบที่ 2 รอบ Quota (รอบโควตา)</li>
            <li>รอบที่ 3 รอบ Admission (รอบแอดมิชชั่น)</li>
            <li>รอบที่ 4 รอบ Direct Admission (รอบรับตรงอิสระ)</li>
          </ul>
          <br />
          TCAS แต่ละรอบมีจุดเด่นและรายละเอียดการรับสมัครที่แตกต่างกัน จำเป็นต้องศึกษาข้อมูลแต่ละรอบอย่างละเอียด
        </div>

        <div className="text-primary-600 text-headline-4 font-semibold mb-6 pt-10">ข้อมูลรอบรับ 67</div>
        <div className="flex justify-center space-x-80 pt-10">
          {rounds.map((round) => (
            <div
              key={round.value}
              className={`relative cursor-pointer text-headline-5 font-semibold ${
                selectedRound === round.value
                  ? 'text-primary-600 border-b-2 border-primary-600 z-10'
                  : 'text-monochrome-950'
              }`}
              onClick={() => setSelectedRound(round.value)}
            >
              {round.label}
              <div
                className={`absolute bottom-0 left-0 right-0 h-0.5 ${
                  selectedRound === round.value
                    ? 'bg-primary-600'
                    : 'bg-transparent'
                }`}
              ></div>
            </div>
          ))}
        </div>

        <div className="border-b-2 border-monochrome-300 ml-2 w-full mt-4 relative"></div>
        <div className="text-monochrome-950 text-body-large leading-relaxed ml-8 whitespace-pre-line mt-6">
          {roundDetails[selectedRound] || 'เลือกรอบที่ต้องการดูรายละเอียด . . .'}
        </div>

        <div className="text-primary-600 text-headline-4 font-semibold mb-6 pt-10">คำถามที่พบบ่อย</div>
        <div className="text-monochrome-950 text-body-large leading-relaxed ml-8 mb-20">
          <ul className="list-disc ml-8">
            <li>
              <b>TCAS67 มีอะไรเปลี่ยนไปจาก TCAS66 บ้าง?</b>
              <br />
              ข้อสอบ TPAT4 เพิ่มจำนวนข้อจาก 40 เป็น 80 ข้อ
              <br />
              เว็บไซต์ myTCAS มีเพิ่มข้อมูลสำคัญ เช่น หลักสูตร ค่าเทอม ฐานเงินเดือน เป็นต้น
              <br />
              กสพท คณะทันตแพทยศาสตร์ สายศิลป์สามารถสมัครได้แล้ว แต่ในรอบอื่นๆ ยังต้องยึดตามคุณสมบัติของคณะ
            </li>
            <li>
              <b>เด็กซิ่วยังสามารถสมัครใน TCAS67 ได้หรือไม่?</b>
              <br />
              สมัครได้ทุกโครงการ แต่บางโควตาอาจกำหนดเฉพาะ ม.6 เท่านั้น
              <br />
              คะแนนสอบ TGAT/TPAT, A-Level และ กสพท มีอายุ 1 ปี ต้องสอบใหม่ทุกปี
            </li>
            <li>
              <b>ลืมรหัสผ่านเข้าระบบ myTCAS ทำอย่างไร?</b>
              <br />
              ไปที่ <a href="https://student.mytcas.com" className="text-primary-500 underline">student.mytcas.com</a> แล้วเลือก "ลืมรหัสผ่าน" และทำตามขั้นตอนที่ระบุ
            </li>
            <li>
              <b>การประมวลผล 2 ครั้งในรอบแอดมิชชั่น คืออะไร?</b>
              <br />
              เป็นการให้โอกาสเพิ่มเติมสำหรับผู้ที่ไม่ติดอันดับแรก โดยสามารถขอประมวลผลใหม่ในสาขาเดิมหากมีที่ว่าง
            </li>
            <li>
              <b>กฎสละสิทธิ์ครั้งเดียว คืออะไร?</b>
              <br />
              ผู้สมัครสามารถสละสิทธิ์ได้เพียงครั้งเดียวในระบบ หากสละแล้วจะไม่สามารถสละสิทธิ์ได้อีก
            </li>
            <li>
              <b>หากสอบติดรอบ Portfolio แล้ว ยังสามารถสอบ TGAT/TPAT หรือ A-Level ได้มั้ย?</b>
              <br />
              ได้ แต่คะแนนจะไม่สามารถนำไปใช้ในรอบอื่นได้หากยืนยันสิทธิ์แล้ว
            </li>
          </ul>
        </div>
      </div>
      <Footer />
    </>
  );
}